<?php

function get_help_config(): array
{
    return [
        [
            'key' => 'sendto',
            'name' => __("إرسال بدون اقتباس إلى القناة"),
            'messages' => [
                [
                    'type' => 'text',
                    'text' =>
                        __("عندما يُنشئ البوت رسالة ويرسلها إليك، وتقوم بإعادة توجيهها إلى قناتك، يبقى اسم البوت في أعلى المنشور. لحل هذه المشكلة يمكنك استخدام خاصية الإرسال بدون اقتباس.") . "\n\n" .
                        __("هناك طريقتان للإرسال بدون اقتباس:") . "\n" .
                        "1- " . __("الإرسال خطوة بخطوة") . "\n" .
                        "2- " . __("الإرسال بأمر واحد فقط") . "\n\n" .
                        __("⚠️ استخدم أمر /sendto_setting لتغيير إعدادات هذه الخاصية.") . "\n\n" .
                        __("⚠️ استخدم أمر /channels لإضافة القنوات إلى القائمة المحددة مسبقاً."),
                ],
                [
                    'type' => 'text',
                    'text' =>
                        "<b>" . __("الإرسال خطوة بخطوة") . "</b>" . "\n\n" .
                        __("لهذا الغرض، أرسل أمر /sendto بمفرده ثم اتبع الخطوات وفق تعليمات البوت."),
                    'parse_mode' => 'html',
                ],
                [
                    'type' => 'text',
                    'text' =>
                        "<b>" . __("الإرسال بأمر واحد فقط") . "</b>" . "\n\n" .
                        __("للقيام بذلك، اتبع الخطوات التالية:") . "\n\n" .
                        sprintf(__("1️⃣ اجعل البوت %s مشرفاً في القناة المطلوبة."), '@' . BOT_USERNAME) . "\n\n" .
                        __("للرسائل التي تحتوي على زر مضمن:") . "\n" .
                        "/sendto {معرف القناة} {الكود}" . "\n\n" .
                        __("للرسائل الأخرى:") . "\n" .
                        "/sendto {معرف القناة}" . "\n\n",
                    'parse_mode' => 'html',
                ],
                [
                    'type' => 'animation',
                    "animation" => MAIN_LINK . "/img/sendto_inlinekey_help_fa.mp4?v1",
                    "caption" => __("📍 شرح إرسال الرسائل بدون اقتباس تحتوي على زر مضمن إلى القناة"),
                ],
                [
                    'type' => 'animation',
                    "animation" => MAIN_LINK . "/img/sendto_other_help_fa.mp4?v1",
                    "caption" => __("📍 شرح إرسال الرسائل الأخرى إلى القناة بدون اقتباس"),
                ],
            ],
        ],
        [
            'key' => 'addadmin',
            'name' => __("كيفية تعيين البوت مشرفاً في القناة"),
            'messages' => [
                [
                    'type' => 'text',
                    'text' =>
                        __("الأمر مثل إضافة صديقك مشرفاً.") . "\n" .
                        sprintf(
                            __("الفرق أنه عند إضافة مشرف بشري تظهر نتائج البحث بمجرد كتابة أول حرف، لكن مع البوت يجب كتابة المعرف اللاتيني <b>كاملاً</b> حتى يظهر في قائمة البحث: %s"),
                            "<code>" . BOT_USERNAME . "</code>",
                        ),
                    'parse_mode' => 'html',
                ],
            ],
        ],
        [
            'key' => 'getid',
            'name' => __("الحصول على معرف القناة الخاصة"),
            'messages' => [
                [
                    'type' => 'text',
                    'text' => __("إذا أردت نشر محتوى في قناة خاصة بدون اقتباس، بما أن القنوات الخاصة لا تملك معرفاً، يجب استخراج معرف القناة أولاً.") . "\n\n" .
                        __("يمكنك استخدام أمر /getid لاستخراج معرف القنوات الخاصة."),
                ],
            ],
        ],
        [
            'key' => 'inlinekey',
            'name' => __("الأزرار المضمنة"),
            'messages' => [
                [
                    'type' => 'text',
                    'text' =>
                        __("مع هذا البوت يمكنك إضافة أي نوع من الأزرار المضمنة (رابط، عداد، إلخ) إلى أي نوع من الرسائل وتعديلها حتى بعد النشر.") . "\n\n" .
                        __("استخدم أمر /inlinekey لإدارة الأزرار المضمنة.") . "\n\n" .
                        __("لديك طريقتان لإنشاء زر مضمن:") . "\n" .
                        __("1 - أرسل /inlinekey أولاً، ثم اختر إضافة.") . "\n" .
                        __("2 - أرسل الرسالة أولاً ثم أرسل أمر /inlinekey رداً عليها."),
                ],
            ],
        ],
        [
            'key' => 'inlinecode',
            'name' => __("ما هو الكود المضمن؟"),
            'messages' => [
                [
                    'type' => 'text',
                    'text' =>
                        __("عند إنشاء زر مضمن، يرسل البوت لك نصاً من 30 حرفاً إنجليزياً تحتاجه لاستخدام الرسالة التي تحتوي على الزر المضمن أو عرض إحصائياتها أو تعديلها أو حذفها."),
                ],
            ],
        ],
        [
            'key' => 'watermark',
            'name' => __("العلامة المائية"),
            'messages' => [
                [
                    'type' => 'text',
                    'text' =>
                        __("استخدم بوت @editgram_bot لإضافة العلامة المائية."),
                ],
            ],
        ],
        [
            'key' => 'attach',
            'name' => __("إرفاق ملف"),
            'messages' => [
                [
                    'type' => 'text',
                    'text' =>
                        __("مع هذا البوت يمكنك إرفاق أي نوع من الملفات (صورة، فيديو، صوت، ملصق، إلخ) بمنشورك.") . "\n" .
                        __("سيظهر الملف أسفل نصك.") . "\n" .
                        __("كل ما عليك هو استخدام أمر /attach."),
                ],
            ],
        ],
        [
            'key' => 'hyper',
            'name' => __("إنشاء رابط مخفي"),
            'messages' => [
                [
                    'type' => 'text',
                    'text' =>
                        __("مع هذا البوت يمكنك إنشاء رسائل مرتبطة بصيغ Markdown وMarkdownV2 وHTML.") . "\n" .
                        __("يمكنك أيضاً إرفاق ملف برسالتك المرتبطة.") . "\n" .
                        __("كل ما عليك هو استخدام أمر /hyper."),
                ],
            ],
        ],
        [
            'key' => 'formatting',
            'name' => __("تنسيق النص"),
            'messages' => [
                [
                    'type' => 'text',
                    'text' =>
                        __("دليل تنسيق النص:") . "\n" .
                        __("https://telegra.ph/chToolsBot-Guide-Text-Formatting-EN-09-10"),
                    'disable_web_page_preview' => false,
                ],
            ],
        ],
        [
            'key' => 'none',
            'name' => __("منشور مجهول الهوية"),
            'messages' => [
                [
                    'type' => 'text',
                    'text' =>
                        __("أحياناً تتلقى رسالة تريد مشاركتها لكن لا تريد ظهور اسم المرسل في أعلى منشورك.") . "\n" .
                        __("لهذا الغرض، أرسل كلمة \"none\" رداً على المنشور المطلوب وسيصبح المنشور مجهول الهوية."),
                ],
            ],
        ],
        [
            'key' => 'contact',
            'name' => __("تواصل معنا"),
            'messages' => [
                [
                    'type' => 'text',
                    'text' => __("للتواصل معنا، أرسل أمر /contact ثم أرسل اقتراحك أو ملاحظتك أو مشكلتك.") . "\n" .
                        __("يمكنك أيضاً إرفاق ملف برسالتك."),
                ],
            ],
        ],
    ];
}

function get_help_menu()
{
    global $tg;

    $help_config = get_help_config();
    $keyboard = [];
    $row = [];

    foreach ($help_config as $item) {
        $row[] = [
            'text' => $item['name'],
            'callback_data' => encode_callback_data(['action' => 'help', 'key' => $item['key']]),
        ];
        if (count($row) == 2) {
            $keyboard[] = $row;
            $row = [];
        }
    }
    if (!empty($row)) {
        $keyboard[] = $row;
    }

    $keyboard[] = [
        ['text' => "⬅️ " . __("رجوع للقائمة"), 'callback_data' => 'menu_back'],
    ];

    return $tg->inlineKeyboardMarkup([
        'inline_keyboard' => $keyboard,
    ]);
}
